app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE (title LIKE '%%' OR description LIKE '%%') LIMIT ?  [["LIMIT", 100]]
---
  def index
    # render(
    #   status: 200,
    #   json: Product.all
    # )
    # Old way
    q = params[:q]

    render(
      status: 200,
      json: Product.all.where(["title LIKE ? OR description LIKE ?", "%#{q}%", "%#{q}%"]).limit(100)#Maybe modify this
    )

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at", "brand", "model", "condition", "year", "finish", "category", "made_in") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    product = Product.new(product_params)

    if product.save